## Linear Regression

In [1]:
import pandas as pd
import numpy as np
import math
from sklearn.linear_model import LinearRegression

In [2]:
df = pd.read_csv('exercise1.csv', sep='\t')
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          8                    9.0                       50000        NaN
1          8                    6.0                       45000        NaN
2       five                    6.0                           7    60000.0
3        two                   10.0                          10    65000.0
4      seven                    9.0                           6    70000.0
5      three                    7.0                          10    62000.0
6        ten                    NaN                           7    72000.0
7     eleven                    7.0                           8    80000.0

In [6]:
median_score = (df['test_score(out of 10)'].median())
median_score

7.0

In [7]:
median_salary = df['salary($)'].median()

In [8]:
df['test_score(out of 10)'] = df['test_score(out of 10)'].fillna(median_score)
df['salary($)'] = df['salary($)'].fillna(median_salary)

In [9]:
df

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0          8                    9.0                       50000    67500.0
1          8                    6.0                       45000    67500.0
2       five                    6.0                           7    60000.0
3        two                   10.0                          10    65000.0
4      seven                    9.0                           6    70000.0
5      three                    7.0                          10    62000.0
6        ten                    7.0                           7    72000.0
7     eleven                    7.0                           8    80000.0

In [13]:
from word2number import w2n

In [18]:
w2n.word_to_num(df.experience[4])

7

In [20]:
df.experience = df.experience.apply(lambda x : w2n.word_to_num(x))

In [21]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           8                    9.0                       50000    67500.0
1           8                    6.0                       45000    67500.0
2           5                    6.0                           7    60000.0
3           2                   10.0                          10    65000.0
4           7                    9.0                           6    70000.0
5           3                    7.0                          10    62000.0
6          10                    7.0                           7    72000.0
7          11                    7.0                           8    80000.0

In [38]:
# Using df.loc[] to access specific rows and columns
# df[ row_from : row_to   ,   col_from : col_to]

In [36]:
X = df.loc[:, 'experience':'interview_score(out of 10)']
X

   experience  test_score(out of 10)  interview_score(out of 10)
0           8                    9.0                       50000
1           8                    6.0                       45000
2           5                    6.0                           7
3           2                   10.0                          10
4           7                    9.0                           6
5           3                    7.0                          10
6          10                    7.0                           7
7          11                    7.0                           8

In [37]:
model = LinearRegression()
model.fit(X, df['salary($)'])
model.score(X, df['salary($)'])

0.838318182667632

In [39]:
import pickle

with open('model1_binary.pickle', 'wb') as f:
    pickle.dump(model, f)

In [40]:
with open('model1_binary.pickle', 'rb') as f:
    model = pickle.load(f)

In [42]:
file = open('model1.pickle', 'wb')
pickle.dump(model, file)
file.close()

In [44]:
file = open('model1.pickle', 'rb')
model = pickle.load(file)
file.close()

In [45]:
# both above ways can be used to dump and load from pickle file
# note to use binary read and write : 'wb' , 'rb'